posts/reading/functional-programming-in-scala/index.org
#+BEGIN_COMMENT
.. title: Functional Programming in Scala
.. slug: functional-programming-in-scala
.. date: 2017-07-15
.. tags: scala, functional programming
.. category: Books
.. link:
.. description:
.. type: text
#+END_COMMENT


* Some Basic Ideas
- FP is based on a simple premise that to construct programs using
  only *pure functions*. Functions that have /no side effects/.
- Side effect examples
  - Reading or Writing to a file
  - Printing to the console or reading user input
  - Drawing on the screen
  - Throwing an excepion or halting with an error
- Functional programming is a restriction on /how/ to write programs,
  but not on /what/ programs we can express.
- Functional programmers often speak of implementing programs with a
  *pure core* and a thin layer on the outside that handles effects.
- Finding ways to structure code so that effects occur but aren't
  *observable*.
  - mutate data that's declared locally in the body of some function,
    if we ensure that it can't be referenced outside the function.
  - write to a file as long as no enclosing function can observe this
    occurring.

** (Pure) function
- A function ~f: (A)=>B~ is a computation that relates every value ~a~
  of type ~A~ to exactly one value ~b~ of type ~B~.
- Such that ~b~ is determined solely by the value of ~a~.
- Any changing state of an internal or external process is irrelevant
  to computing the result.
- If it really is a ~function~, it will do nothing else.
- a function has no /observable effect/ on the execution of the
  program other than to compute the result given its inputs.
- Function vs Procedure : whether to have side effects.
- *Referentially Transparent* : the expression can be replaced by its
  result without changing the meaning of the program.
  - It forces the invariant that everything a function does is
    represented by the value that it returns.
  - This constrains enables a simple and natural mode of reasoning
    about program evaluation : *substitution model*.
- Functional programs are often more modular due to this.
  - Modular programs consist of components that can be understood and
    reused *independently* of the whole.
  - Such that the meaning of the whole depends only on the meaning of
    the components and the rules governing their composition.
  - That is, they are *composable*.

** Loop without mutating a loop variable
- An example for looping with recursion:
  #+BEGIN_SRC scala
  def factorial(n: Int) : Int ={
    def go(n: Int, acc: Int)  : Int = {
      if (n<=0) acc
      else go(n-1, n*acc)
    }
    go(n, 1)
  }
  #+END_SRC
- The argument to ~go~ are the state for the loop. In this case, it is
  the remaining value ~n~, and the current accumulated factorial ~acc~.
- To advanced to the next iteration, simply call the ~go~ recursively
  with the /new loop state/.
- And to exist the loop, return a value without a recursive call.
- Scala detects this sort of *self-recursion* and compiles it to the
  same sort of bytecode as would be emitted for a ~while~ loop, as
  long as the recursive call is in *tail position*.
  - This optimization is called tail call elimination.
  - applied when there is no additional work left to do after the
    recursive call returns.
  - annotation ~@tailrec~ can be used to tell Scala compiler about
    this assumption.

** ADT(algebraic data type)
- An ADT is a data type defined by one or more data constructors, each
  of which may contain zero or more arguments.
- The data type is the *sum*, or *union* of its data constructors
- And each data constructor is the *product* of its arguments.
- Hence the name *algebraic data type*
  - The naming is not coincidental.
  - There is a deep connection between the "addition" and
    "multiplication" of types to form an ADT and addition and
    multiplication of numbers.
- Algebraic data types can be used to define other data structures.
- One might object that algebraic data types violate encapsulation by
  making public the internal representation of type.
- However in FP, the approach to encapsulation is different, it
  doesn't typically have delicate mutable state which could lead to
  bugs or violation of invariants if exposed publicly.
- ADTs is typically used for situations where the set of cases is
  closed(known to be fixed)

