posts/reading/functional-programming-in-scala/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Functional Programming in Scala | Warren Liu</title>
<link href="../../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="https://example.com/posts/reading/functional-programming-in-scala/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../go-in-action/" title="Go In Action" type="text/html">
<link rel="next" href="../enterprise-integration-patterns/" title="Enterprise Integration Patterns" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="Functional Programming in Scala">
<meta property="og:url" content="https://example.com/posts/reading/functional-programming-in-scala/">
<meta property="og:description" content="Table of Contents


Some Basic Ideas

(Pure) function
Loop without mutating a loop variable
ADT(algebraic data type)


Handling Errors

Partial function
Option, Either and Try


Strictness and Lazines">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-15T00:00:00+01:00">
<meta property="article:tag" content="functional programming">
<meta property="article:tag" content="scala">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">Warren Liu</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../../archive.html">Archive</a>
                </li>
<li>
<a href="../../../categories/">Tags</a>
                </li>
<li>
<a href="../../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Functional Programming in Scala</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Warren Liu
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-07-15T00:00:00+01:00" itemprop="datePublished" title="2017-07-15 00:00">2017-07-15 00:00</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li>
<a href="#sec-1">Some Basic Ideas</a>
<ul>
<li><a href="#sec-1-1">(Pure) function</a></li>
<li><a href="#sec-1-2">Loop without mutating a loop variable</a></li>
<li><a href="#sec-1-3">ADT(algebraic data type)</a></li>
</ul>
</li>
<li>
<a href="#sec-2">Handling Errors</a>
<ul>
<li><a href="#sec-2-1">Partial function</a></li>
<li><a href="#sec-2-2"><code>Option</code>, <code>Either</code> and <code>Try</code></a></li>
</ul>
</li>
<li><a href="#sec-3">Strictness and Laziness</a></li>
<li><a href="#sec-4">Purely functional state</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Some Basic Ideas</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>FP is based on a simple premise that to construct programs using
only <b>pure functions</b>. Functions that have <i>no side effects</i>.
</li>
<li>Side effect examples
<ul class="org-ul">
<li>Reading or Writing to a file
</li>
<li>Printing to the console or reading user input
</li>
<li>Drawing on the screen
</li>
<li>Throwing an excepion or halting with an error
</li>
</ul>
</li>
<li>Functional programming is a restriction on <i>how</i> to write programs,
but not on <i>what</i> programs we can express.
</li>
<li>Functional programmers often speak of implementing programs with a
<b>pure core</b> and a thin layer on the outside that handles effects.
</li>
<li>Finding ways to structure code so that effects occur but aren't
<b>observable</b>.
<ul class="org-ul">
<li>mutate data that's declared locally in the body of some function,
if we ensure that it can't be referenced outside the function.
</li>
<li>write to a file as long as no enclosing function can observe this
occurring.
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">(Pure) function</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>A function <code>f: (A)=&gt;B</code> is a computation that relates every value <code>a</code>
  of type <code>A</code> to exactly one value <code>b</code> of type <code>B</code>.
</li>
<li>Such that <code>b</code> is determined solely by the value of <code>a</code>.
</li>
<li>Any changing state of an internal or external process is irrelevant
to computing the result.
</li>
<li>If it really is a <code>function</code>, it will do nothing else.
</li>
<li>a function has no <i>observable effect</i> on the execution of the
program other than to compute the result given its inputs.
</li>
<li>Function vs Procedure : whether to have side effects.
</li>
<li>
<b>Referentially Transparent</b> : the expression can be replaced by its
result without changing the meaning of the program.
<ul class="org-ul">
<li>It forces the invariant that everything a function does is
represented by the value that it returns.
</li>
<li>This constrains enables a simple and natural mode of reasoning
about program evaluation : <b>substitution model</b>.
</li>
</ul>
</li>
<li>Functional programs are often more modular due to this.
<ul class="org-ul">
<li>Modular programs consist of components that can be understood and
reused <b>independently</b> of the whole.
</li>
<li>Such that the meaning of the whole depends only on the meaning of
the components and the rules governing their composition.
</li>
<li>That is, they are <b>composable</b>.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Loop without mutating a loop variable</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>An example for looping with recursion:
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="n">factorial</span><span class="o">(</span><span class="n">n</span><span class="k">:</span> <span class="kt">Int</span><span class="o">)</span> <span class="k">:</span> <span class="kt">Int</span> <span class="o">={</span>
  <span class="k">def</span> <span class="n">go</span><span class="o">(</span><span class="n">n</span><span class="k">:</span> <span class="kt">Int</span><span class="o">,</span> <span class="n">acc</span><span class="k">:</span> <span class="kt">Int</span><span class="o">)</span>  <span class="k">:</span> <span class="kt">Int</span> <span class="o">=</span> <span class="o">{</span>
    <span class="k">if</span> <span class="o">(</span><span class="n">n</span><span class="o">&lt;=</span><span class="mi">0</span><span class="o">)</span> <span class="n">acc</span>
    <span class="k">else</span> <span class="n">go</span><span class="o">(</span><span class="n">n</span><span class="o">-</span><span class="mi">1</span><span class="o">,</span> <span class="n">n</span><span class="o">*</span><span class="n">acc</span><span class="o">)</span>
  <span class="o">}</span>
  <span class="n">go</span><span class="o">(</span><span class="n">n</span><span class="o">,</span> <span class="mi">1</span><span class="o">)</span>
<span class="o">}</span>
</pre></div>
</li>
<li>The argument to <code>go</code> are the state for the loop. In this case, it is
the remaining value <code>n</code>, and the current accumulated factorial <code>acc</code>.
</li>
<li>To advanced to the next iteration, simply call the <code>go</code> recursively
with the <i>new loop state</i>.
</li>
<li>And to exist the loop, return a value without a recursive call.
</li>
<li>Scala detects this sort of <b>self-recursion</b> and compiles it to the
same sort of bytecode as would be emitted for a <code>while</code> loop, as
long as the recursive call is in <b>tail position</b>.
<ul class="org-ul">
<li>This optimization is called tail call elimination.
</li>
<li>applied when there is no additional work left to do after the
recursive call returns.
</li>
<li>annotation <code>@tailrec</code> can be used to tell Scala compiler about
this assumption.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">ADT(algebraic data type)</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>An ADT is a data type defined by one or more data constructors, each
of which may contain zero or more arguments.
</li>
<li>The data type is the <b>sum</b>, or <b>union</b> of its data constructors
</li>
<li>And each data constructor is the <b>product</b> of its arguments.
</li>
<li>Hence the name <b>algebraic data type</b>
<ul class="org-ul">
<li>The naming is not coincidental.
</li>
<li>There is a deep connection between the "addition" and
"multiplication" of types to form an ADT and addition and
multiplication of numbers.
</li>
</ul>
</li>
<li>Algebraic data types can be used to define other data structures.
</li>
<li>One might object that algebraic data types violate encapsulation by
making public the internal representation of type.
</li>
<li>However in FP, the approach to encapsulation is different, it
doesn't typically have delicate mutable state which could lead to
bugs or violation of invariants if exposed publicly.
</li>
<li>ADTs is typically used for situations where the set of cases is
closed(known to be fixed)
</li>
</ul>
</div>
</div>
</div>
