posts/reading/functional-programming-in-scala/index.org
* Handling Errors
- Two major problem with exceptions:
  - Exceptions break referential transparent.
  - Exceptions are not type-safe.
- Instead of throwing an exception, we can return a value indicating
  that an exceptional condition has occurred.
** Partial function
- It is not defined for some input.
- An example:
  #+BEGIN_SRC scala
    def mean(xs: Seq[Double]) : Double =
      if (xs.isEmpty) throw new ArithmeticException("mean of empty list!")
      else xs.sum / xs.length

    def mean2(xs: Seq[Doubl]) : Option[Double] =
      if (xs.isEmpty) None
      else Some(xs.sum / xs.length)
  #+END_SRC
