posts/reading/functional-programming-in-scala/index.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Handling Errors</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Two major problem with exceptions:
<ul class="org-ul">
<li>Exceptions break referential transparent.
</li>
<li>Exceptions are not type-safe.
</li>
</ul>
</li>
<li>Instead of throwing an exception, we can return a value indicating
that an exceptional condition has occurred.
</li>
</ul>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Partial function</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>It is not defined for some input.
</li>
<li>An example:
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="n">mean</span><span class="o">(</span><span class="n">xs</span><span class="k">:</span> <span class="kt">Seq</span><span class="o">[</span><span class="kt">Double</span><span class="o">])</span> <span class="k">:</span> <span class="kt">Double</span> <span class="o">=</span>
  <span class="k">if</span> <span class="o">(</span><span class="n">xs</span><span class="o">.</span><span class="n">isEmpty</span><span class="o">)</span> <span class="k">throw</span> <span class="k">new</span> <span class="nc">ArithmeticException</span><span class="o">(</span><span class="s">"mean of empty list!"</span><span class="o">)</span>
  <span class="k">else</span> <span class="n">xs</span><span class="o">.</span><span class="n">sum</span> <span class="o">/</span> <span class="n">xs</span><span class="o">.</span><span class="n">length</span>

<span class="k">def</span> <span class="n">mean2</span><span class="o">(</span><span class="n">xs</span><span class="k">:</span> <span class="kt">Seq</span><span class="o">[</span><span class="kt">Doubl</span><span class="o">])</span> <span class="k">:</span> <span class="kt">Option</span><span class="o">[</span><span class="kt">Double</span><span class="o">]</span> <span class="k">=</span>
  <span class="k">if</span> <span class="o">(</span><span class="n">xs</span><span class="o">.</span><span class="n">isEmpty</span><span class="o">)</span> <span class="nc">None</span>
  <span class="k">else</span> <span class="nc">Some</span><span class="o">(</span><span class="n">xs</span><span class="o">.</span><span class="n">sum</span> <span class="o">/</span> <span class="n">xs</span><span class="o">.</span><span class="n">length</span><span class="o">)</span>
</pre></div>
</li>
</ul>
</div>
</div>
