posts/reading/functional-programming-in-scala/index.org
** ~Option~, ~Either~ and ~Try~
- ~filter(f: A=>Boolean): Option[A]~ : can convert successes into
  failure if the successful value doesn't match the given predicate.
- ~getOrElse(default: =>B) : B~ : return ~defulat~ if undefined.
- ~orElse(ob: =>Option[B]) : Option[B]~ : return another Option if the
  first is undefined. This is often useful when we need to chain
  together possibly failing computations, trying the second if the
  first hasn't succeeded.
- A common idiom is to do ~o.getOrElse(throw new Exception("FAIL"))~
    to convert the ~None~ case of an Option back to an exception.
  - use it only if no reasonable program would ever catch the
      exception.
- Convert existed function to be Option-aware
  - ~lift~ of ordinary functions to operate on ~Option~
      #+BEGIN_SRC scala
        def lift[A, B](f : A=>B) : Option[A] => Option[B] = _ map f
        def map2[A,B,C](a : Option[A], b: Option[B](f: (A, B)=> C): Option[C] = {
          //TODO.
        }
        val absO : Option[Double] => Option[Double] = lift(math.abs)
      #+END_SRC
  - ~Try~ : a general-purpose function to convert from an
    exception-based API to an Option-oriented API:
      #+BEGIN_SRC scala
        def Try[A](a: =>A): Option[A] =
          try Some(a)
          catch { case e: Exception => None }
      #+END_SRC
- ~Either~ data type: sometimes just knowing whether a failure
  occurred is insufficient when more information about failure is
  wanted. the ~Either~ data type is designed for the purpose.
    #+BEGIN_SRC scala
      seal trait Either[+E, +A]
      case class Left[+E](value: E) extends Either[E, Nothing]
      case class Right[+A](value: A) extends Either[Nothing, A]
    #+END_SRC
  - Both cases carry a value.
- A common use of ~Either~ is as an alternative to ~Option~ for
  dealing with possibly missing values.
  - In this usage, ~None~ is replaced with a ~Left~ which can
    contain useful information. ~Right~ takes the place of ~Some~.
  - Convention dictates that ~Left~ is used for failure and ~Right~
    is used for success.
- ~Try~ represents a computation that may either result in an
  exception, or return a successful computed value.
  - Similar to ~Either~, but semantically different.
  - Instance of ~Try[T]~, are either an ~Success[T]~ or a ~Failure[t]~
  - Example:
    #+BEGIN_SRC scala
      import scala.io.StdIn
      import scala.util.{Try, Success, Failure}

      def divide: Try[Int] = {
        val dividend = Try(StdIn.readLine("Enter an Int that you'd like to divide:\n").toInt)
        val divisor = Try(StdIn.readLine("Enter an Int that you'd like to divide by:\n").toInt)
        val problem = dividend.flatMap(x => divisor.map(y => x/y))
        problem match {
          case Success(v) =>
            println("Result of " + dividend.get + "/"+ divisor.get +" is: " + v)
            Success(v)
          case Failure(e) =>
            println("You must've divided by zero or entered something that's not an Int. Try again!")
            println("Info from the exception: " + e.getMessage)
            divide
        }
      }
    #+END_SRC
  - An important property of *Try* shown in the above example is its
    ability to pipeline, or chain, operations, catching exceptions
    along the way.
