posts/reading/functional-programming-in-scala/index.html
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">
<code>Option</code>, <code>Either</code> and <code>Try</code>
</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>
<code>filter(f: A=&gt;Boolean): Option[A]</code> : can convert successes into
failure if the successful value doesn't match the given predicate.
</li>
<li>
<code>getOrElse(default: =&gt;B) : B</code> : return <code>defulat</code> if undefined.
</li>
<li>
<code>orElse(ob: =&gt;Option[B]) : Option[B]</code> : return another Option if the
first is undefined. This is often useful when we need to chain
together possibly failing computations, trying the second if the
first hasn't succeeded.
</li>
<li>A common idiom is to do <code>o.getOrElse(throw new Exception("FAIL"))</code>
    to convert the <code>None</code> case of an Option back to an exception.
<ul class="org-ul">
<li>use it only if no reasonable program would ever catch the
exception.
</li>
</ul>
</li>
<li>Convert existed function to be Option-aware
<ul class="org-ul">
<li>
<code>lift</code> of ordinary functions to operate on <code>Option</code>
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="n">lift</span><span class="o">[</span><span class="kt">A</span>, <span class="kt">B</span><span class="o">](</span><span class="n">f</span> <span class="k">:</span> <span class="kt">A</span><span class="o">=&gt;</span><span class="n">B</span><span class="o">)</span> <span class="k">:</span> <span class="kt">Option</span><span class="o">[</span><span class="kt">A</span><span class="o">]</span> <span class="k">=&gt;</span> <span class="nc">Option</span><span class="o">[</span><span class="kt">B</span><span class="o">]</span> <span class="k">=</span> <span class="k">_</span> <span class="n">map</span> <span class="n">f</span>
<span class="k">def</span> <span class="n">map2</span><span class="o">[</span><span class="kt">A</span>,<span class="kt">B</span>,<span class="kt">C</span><span class="o">](</span><span class="n">a</span> <span class="k">:</span> <span class="kt">Option</span><span class="o">[</span><span class="kt">A</span><span class="o">],</span> <span class="n">b</span><span class="k">:</span> <span class="kt">Option</span><span class="o">[</span><span class="kt">B</span><span class="o">](</span><span class="n">f</span><span class="k">:</span> <span class="o">(</span><span class="kt">A</span><span class="o">,</span> <span class="kt">B</span><span class="o">)</span><span class="k">=&gt;</span> <span class="n">C</span><span class="o">)</span><span class="k">:</span> <span class="kt">Option</span><span class="o">[</span><span class="kt">C</span><span class="o">]</span> <span class="k">=</span> <span class="o">{</span>
  <span class="c1">//TODO.</span>
<span class="o">}</span>
<span class="k">val</span> <span class="n">absO</span> <span class="k">:</span> <span class="kt">Option</span><span class="o">[</span><span class="kt">Double</span><span class="o">]</span> <span class="k">=&gt;</span> <span class="nc">Option</span><span class="o">[</span><span class="kt">Double</span><span class="o">]</span> <span class="k">=</span> <span class="n">lift</span><span class="o">(</span><span class="n">math</span><span class="o">.</span><span class="n">abs</span><span class="o">)</span>
</pre></div>
</li>
<li>
<code>Try</code> : a general-purpose function to convert from an
exception-based API to an Option-oriented API:
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="nc">Try</span><span class="o">[</span><span class="kt">A</span><span class="o">](</span><span class="n">a</span><span class="k">:</span> <span class="o">=&gt;</span><span class="n">A</span><span class="o">)</span><span class="k">:</span> <span class="kt">Option</span><span class="o">[</span><span class="kt">A</span><span class="o">]</span> <span class="k">=</span>
  <span class="k">try</span> <span class="nc">Some</span><span class="o">(</span><span class="n">a</span><span class="o">)</span>
  <span class="k">catch</span> <span class="o">{</span> <span class="k">case</span> <span class="n">e</span><span class="k">:</span> <span class="kt">Exception</span> <span class="o">=&gt;</span> <span class="nc">None</span> <span class="o">}</span>
</pre></div>
</li>
</ul>
</li>
<li>
<code>Either</code> data type: sometimes just knowing whether a failure
occurred is insufficient when more information about failure is
wanted. the <code>Either</code> data type is designed for the purpose.
<div class="highlight"><pre><span></span><span class="n">seal</span> <span class="k">trait</span> <span class="nc">Either</span><span class="o">[</span><span class="kt">+E</span>, <span class="kt">+A</span><span class="o">]</span>
<span class="nc">case</span> <span class="k">class</span> <span class="nc">Left</span><span class="o">[</span><span class="kt">+E</span><span class="o">](</span><span class="n">value</span><span class="k">:</span> <span class="kt">E</span><span class="o">)</span> <span class="k">extends</span> <span class="nc">Either</span><span class="o">[</span><span class="kt">E</span>, <span class="kt">Nothing</span><span class="o">]</span>
<span class="k">case</span> <span class="k">class</span> <span class="nc">Right</span><span class="o">[</span><span class="kt">+A</span><span class="o">](</span><span class="n">value</span><span class="k">:</span> <span class="kt">A</span><span class="o">)</span> <span class="k">extends</span> <span class="nc">Either</span><span class="o">[</span><span class="kt">Nothing</span>, <span class="kt">A</span><span class="o">]</span>
</pre></div>
<ul class="org-ul">
<li>Both cases carry a value.
</li>
</ul>
</li>
<li>A common use of <code>Either</code> is as an alternative to <code>Option</code> for
dealing with possibly missing values.
<ul class="org-ul">
<li>In this usage, <code>None</code> is replaced with a <code>Left</code> which can
contain useful information. <code>Right</code> takes the place of <code>Some</code>.
</li>
<li>Convention dictates that <code>Left</code> is used for failure and <code>Right</code>
    is used for success.
</li>
</ul>
</li>
<li>
<code>Try</code> represents a computation that may either result in an
exception, or return a successful computed value.
<ul class="org-ul">
<li>Similar to <code>Either</code>, but semantically different.
</li>
<li>Instance of <code>Try[T]</code>, are either an <code>Success[T]</code> or a <code>Failure[t]</code>
</li>
<li>Example:
<div class="highlight"><pre><span></span><span class="k">import</span> <span class="nn">scala.io.StdIn</span>
<span class="k">import</span> <span class="nn">scala.util.</span><span class="o">{</span><span class="nc">Try</span><span class="o">,</span> <span class="nc">Success</span><span class="o">,</span> <span class="nc">Failure</span><span class="o">}</span>

<span class="k">def</span> <span class="n">divide</span><span class="k">:</span> <span class="kt">Try</span><span class="o">[</span><span class="kt">Int</span><span class="o">]</span> <span class="k">=</span> <span class="o">{</span>
  <span class="k">val</span> <span class="n">dividend</span> <span class="k">=</span> <span class="nc">Try</span><span class="o">(</span><span class="nc">StdIn</span><span class="o">.</span><span class="n">readLine</span><span class="o">(</span><span class="s">"Enter an Int that you'd like to divide:\n"</span><span class="o">).</span><span class="n">toInt</span><span class="o">)</span>
  <span class="k">val</span> <span class="n">divisor</span> <span class="k">=</span> <span class="nc">Try</span><span class="o">(</span><span class="nc">StdIn</span><span class="o">.</span><span class="n">readLine</span><span class="o">(</span><span class="s">"Enter an Int that you'd like to divide by:\n"</span><span class="o">).</span><span class="n">toInt</span><span class="o">)</span>
  <span class="k">val</span> <span class="n">problem</span> <span class="k">=</span> <span class="n">dividend</span><span class="o">.</span><span class="n">flatMap</span><span class="o">(</span><span class="n">x</span> <span class="k">=&gt;</span> <span class="n">divisor</span><span class="o">.</span><span class="n">map</span><span class="o">(</span><span class="n">y</span> <span class="k">=&gt;</span> <span class="n">x</span><span class="o">/</span><span class="n">y</span><span class="o">))</span>
  <span class="n">problem</span> <span class="k">match</span> <span class="o">{</span>
    <span class="k">case</span> <span class="nc">Success</span><span class="o">(</span><span class="n">v</span><span class="o">)</span> <span class="k">=&gt;</span>
      <span class="n">println</span><span class="o">(</span><span class="s">"Result of "</span> <span class="o">+</span> <span class="n">dividend</span><span class="o">.</span><span class="n">get</span> <span class="o">+</span> <span class="s">"/"</span><span class="o">+</span> <span class="n">divisor</span><span class="o">.</span><span class="n">get</span> <span class="o">+</span><span class="s">" is: "</span> <span class="o">+</span> <span class="n">v</span><span class="o">)</span>
      <span class="nc">Success</span><span class="o">(</span><span class="n">v</span><span class="o">)</span>
    <span class="k">case</span> <span class="nc">Failure</span><span class="o">(</span><span class="n">e</span><span class="o">)</span> <span class="k">=&gt;</span>
      <span class="n">println</span><span class="o">(</span><span class="s">"You must've divided by zero or entered something that's not an Int. Try again!"</span><span class="o">)</span>
      <span class="n">println</span><span class="o">(</span><span class="s">"Info from the exception: "</span> <span class="o">+</span> <span class="n">e</span><span class="o">.</span><span class="n">getMessage</span><span class="o">)</span>
      <span class="n">divide</span>
  <span class="o">}</span>
<span class="o">}</span>
</pre></div>
</li>
<li>An important property of <b>Try</b> shown in the above example is its
ability to pipeline, or chain, operations, catching exceptions
along the way.
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
