posts/reading/functional-programming-in-scala/index.org
* Strictness and Laziness
- Scala collection function like ~map~, ~filter~ are *strict functions*
  that produce intermediate temporary collections when called in chain.
- a non-strict function may choose *not* to evaluate one, or more of
  its arguments, while a strict function will always evaluates its
  arguments.
- ~if~ can be think as a function accepting three parameters. This
  function would be non-strict, since it won't evaluate all of its
  arguments.
- In scala, we can write non-strict functions by accepting some of our
  arguments un-evaluated, for example:
  #+BEGIN_SRC scala
  def if2[A](cond: Boolean, onTrue: ()=>A, onFalse: ()=>A): A =
      if (cond) onTrue() else onFalse()
  #+END_SRC
  Or with pass-by-reference:
  #+BEGIN_SRC scala
  def if2[A](cond: Boolean, onTrue: => A, onFalse: => A) :A =
      if (cond) onTrue else onFalse
  #+END_SRC
- Adding the ~lazy~ keyword to a ~val~ declaration will cause Scala to
  delay evaluation of the right-hand side of the declaration, until it
  is first referenced. It will also cache the result so that
  subsequent references to it don't trigger repeated evaluation.
- A major theme in FP is /separation of concerns/. We want to separate
  the description of computations from actually running them.
  - Laizness lets us separate the description of an expression from
    the evaluation of that expression.
  - We may choose to describe a /larger/ expression than we need, and
    then evaluate only a portion of it.
    #+BEGIN_SRC scala
    def exists(p: A=>Boolean): Boolean = this match {
        case Cons(h, t) => p(h()) || t().exists(p)
        case _ => false
    }
    #+END_SRC
    Note that ~||~ is non-strict in its second argument.

* Purely functional state
- The key to recovering referential transparency is to *make the state
  updates explicit*. Don't update the state as a side effect, but
  simply *return the new state* along with the value that we are return.
- An example for a random number generator:
  #+BEGIN_SRC scala
  trait RNG {
       def nextInt: (Int, RNG)
  }
  #+END_SRC
  - Rather than returning only the generated random number, and
    updating some internal state by /mmutating/ it in place, we return
    the random number *and* the new state, leaving the old state
    unmodified.
  - It separating the concern of *computing* what the next state is
    from the concern of *communicating* the new state to the rest of
    the program.
- The function has a type of the form ~RNG => (A, RNG)~. Functions of
  this type are called *state actions* or *state transitions* because
  they transform *RNG* states from one to the next.
  - It will be quite tedious and repetitive to passing the state.
- This state actions can be combined using *combinators*, which are
  higher-order functions. The combinators will pass the state from one
  action to the next automatically.
