posts/reading/functional-programming-in-scala/index.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Strictness and Laziness</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Scala collection function like <code>map</code>, <code>filter</code> are <b>strict functions</b>
  that produce intermediate temporary collections when called in chain.
</li>
<li>a non-strict function may choose <b>not</b> to evaluate one, or more of
its arguments, while a strict function will always evaluates its
arguments.
</li>
<li>
<code>if</code> can be think as a function accepting three parameters. This
function would be non-strict, since it won't evaluate all of its
arguments.
</li>
<li>In scala, we can write non-strict functions by accepting some of our
arguments un-evaluated, for example:
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="n">if2</span><span class="o">[</span><span class="kt">A</span><span class="o">](</span><span class="n">cond</span><span class="k">:</span> <span class="kt">Boolean</span><span class="o">,</span> <span class="n">onTrue</span><span class="k">:</span> <span class="o">()=&gt;</span><span class="n">A</span><span class="o">,</span> <span class="n">onFalse</span><span class="k">:</span> <span class="o">()=&gt;</span><span class="n">A</span><span class="o">)</span><span class="k">:</span> <span class="kt">A</span> <span class="o">=</span>
    <span class="k">if</span> <span class="o">(</span><span class="n">cond</span><span class="o">)</span> <span class="n">onTrue</span><span class="o">()</span> <span class="k">else</span> <span class="n">onFalse</span><span class="o">()</span>
</pre></div>
<p>
Or with pass-by-reference:
</p>
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="n">if2</span><span class="o">[</span><span class="kt">A</span><span class="o">](</span><span class="n">cond</span><span class="k">:</span> <span class="kt">Boolean</span><span class="o">,</span> <span class="n">onTrue</span><span class="k">:</span> <span class="o">=&gt;</span> <span class="n">A</span><span class="o">,</span> <span class="n">onFalse</span><span class="k">:</span> <span class="o">=&gt;</span> <span class="n">A</span><span class="o">)</span> <span class="k">:</span><span class="kt">A</span> <span class="o">=</span>
    <span class="k">if</span> <span class="o">(</span><span class="n">cond</span><span class="o">)</span> <span class="n">onTrue</span> <span class="k">else</span> <span class="n">onFalse</span>
</pre></div>
</li>
<li>Adding the <code>lazy</code> keyword to a <code>val</code> declaration will cause Scala to
delay evaluation of the right-hand side of the declaration, until it
is first referenced. It will also cache the result so that
subsequent references to it don't trigger repeated evaluation.
</li>
<li>A major theme in FP is <i>separation of concerns</i>. We want to separate
the description of computations from actually running them.
<ul class="org-ul">
<li>Laizness lets us separate the description of an expression from
the evaluation of that expression.
</li>
<li>We may choose to describe a <i>larger</i> expression than we need, and
then evaluate only a portion of it.
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="n">exists</span><span class="o">(</span><span class="n">p</span><span class="k">:</span> <span class="kt">A</span><span class="o">=&gt;</span><span class="nc">Boolean</span><span class="o">)</span><span class="k">:</span> <span class="kt">Boolean</span> <span class="o">=</span> <span class="k">this</span> <span class="k">match</span> <span class="o">{</span>
    <span class="k">case</span> <span class="nc">Cons</span><span class="o">(</span><span class="n">h</span><span class="o">,</span> <span class="n">t</span><span class="o">)</span> <span class="k">=&gt;</span> <span class="n">p</span><span class="o">(</span><span class="n">h</span><span class="o">())</span> <span class="o">||</span> <span class="n">t</span><span class="o">().</span><span class="n">exists</span><span class="o">(</span><span class="n">p</span><span class="o">)</span>
    <span class="k">case</span> <span class="k">_</span> <span class="k">=&gt;</span> <span class="kc">false</span>
<span class="o">}</span>
</pre></div>
<p>
Note that <code>||</code> is non-strict in its second argument.
</p>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Purely functional state</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>The key to recovering referential transparency is to <b>make the state
updates explicit</b>. Don't update the state as a side effect, but
simply <b>return the new state</b> along with the value that we are return.
</li>
<li>An example for a random number generator:
<div class="highlight"><pre><span></span><span class="k">trait</span> <span class="nc">RNG</span> <span class="o">{</span>
     <span class="k">def</span> <span class="n">nextInt</span><span class="k">:</span> <span class="o">(</span><span class="kt">Int</span><span class="o">,</span> <span class="kt">RNG</span><span class="o">)</span>
<span class="o">}</span>
</pre></div>
<ul class="org-ul">
<li>Rather than returning only the generated random number, and
updating some internal state by <i>mmutating</i> it in place, we return
the random number <b>and</b> the new state, leaving the old state
unmodified.
</li>
<li>It separating the concern of <b>computing</b> what the next state is
from the concern of <b>communicating</b> the new state to the rest of
the program.
</li>
</ul>
</li>
<li>The function has a type of the form <code>RNG =&gt; (A, RNG)</code>. Functions of
this type are called <b>state actions</b> or <b>state transitions</b> because
they transform <b>RNG</b> states from one to the next.
<ul class="org-ul">
<li>It will be quite tedious and repetitive to passing the state.
</li>
</ul>
</li>
<li>This state actions can be combined using <b>combinators</b>, which are
higher-order functions. The combinators will pass the state from one
action to the next automatically.
</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/functional-programming/" rel="tag">functional programming</a></li>
            <li><a class="tag p-category" href="../../../categories/scala/" rel="tag">scala</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../go-in-action/" rel="prev" title="Go In Action">Previous post</a>
            </li>
            <li class="next">
                <a href="../enterprise-integration-patterns/" rel="next" title="Enterprise Integration Patterns">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:n.tesla@example.com">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
